#pragma once

#include <SFML/Graphics.hpp>
#include "grid.h"
#include "settings.h"

// Клас вікна гри, який відповідає за виконання головного циклу гри,
// обробку команд та рендеринг зображення
class GameWindow {
private:
    sf::RenderWindow window; // Вікно для відображення гри
    sf::Vector2i mousePosition; // Позиція миші
    bool pause; // Статус паузи
    GameGrid gameGrid; // Ігрова сітка

public:
    GameWindow(int width, int height);
    // Конструктор класу GameWindow. Створює вікно заданого розміру та ініціалізує ігрову сітку

    void run();
    // Метод запуску гри "Гра життя". У циклі обробляє події, оновлює стан
    // ігрової сітки та відтворює її на екрані

private:
    void eventHandler();
    // Метод обробки події закриття вікна. Перевіряє, чи була подія закриття вікна,
    // і якщо так, то закриває вікно

    void render();
    // Метод відображення ігрової сітки. Очищає вікно, потім перебирає всі клітини ігрової сітки
    // і відмальовує живі клітини з використанням прямокутника. Потім відображає вміст вікна
};